# GROUP BY


Groupby allows you to group together rows based on a column and perform a particular aggregate function on them.

### Aggregate Function

1. SUM
2. AVERAGE
3. STANDARD DEVIATION

In [4]:
import pandas as pd

In [6]:
data = {'A':['RAM','RAM','RAM','SYAM','SYAM','SYAM'],
        'B':['PHY','MAT','CHE','PHY','MAT','CHE'],
        'C':[70,78,89,70,78,89]
       }

In [7]:
data

{'A': ['RAM', 'RAM', 'RAM', 'SYAM', 'SYAM', 'SYAM'],
 'B': ['PHY', 'MAT', 'CHE', 'PHY', 'MAT', 'CHE'],
 'C': [70, 78, 89, 70, 78, 89]}

In [8]:
df = pd.DataFrame(data)
df

      A    B   C
0   RAM  PHY  70
1   RAM  MAT  78
2   RAM  CHE  89
3  SYAM  PHY  70
4  SYAM  MAT  78
5  SYAM  CHE  89

In [11]:
byA= df.groupby('A')

In [13]:
byA.mean()

       C
A
RAM   79
SYAM  79

In [14]:
byB = df.groupby('B')

In [15]:
byB.sum()

       C
B
CHE  178
MAT  156
PHY  140

In [18]:
byA.sum().loc['RAM']

C    237
Name: RAM, dtype: int64

In [19]:
byA.count()

      B  C
A
RAM   3  3
SYAM  3  3

In [20]:
byA.max()

        B   C
A
RAM   PHY  89
SYAM  PHY  89

In [23]:
byA.describe().transpose()['RAM']

C  count     3.000000
   mean     79.000000
   std       9.539392
   min      70.000000
   25%      74.000000
   50%      78.000000
   75%      83.500000
   max      89.000000
Name: RAM, dtype: float64